Ran Plan for project: `staging` dir: `terraform` workspace: `staging`

<details><summary>Show Output</summary>

```diff
+---------+-----------------------------------------------------------------------------------+-----------+---------+
| RESULT  |                                       FILE                                        | NAMESPACE | MESSAGE |
+---------+-----------------------------------------------------------------------------------+-----------+---------+
| success | /atlantis-data/repos/leandromoreirati/my-storage/1/staging/terraform/versions.tf  | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/my-storage/1/staging/terraform/backend.tf   | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/my-storage/1/staging/terraform/main.tf      | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/my-storage/1/staging/terraform/outputs.tf   | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/my-storage/1/staging/terraform/providers.tf | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/my-storage/1/staging/terraform/variables.tf | main      | SUCCESS |
+---------+-----------------------------------------------------------------------------------+-----------+---------+

staging

2024-07-29T00:14:25.784Z [INFO]  Terraform version: 1.4.6
2024-07-29T00:14:25.784Z [INFO]  Go runtime version: go1.19.6
2024-07-29T00:14:25.784Z [INFO]  CLI args: []string{"/atlantis-data/bin/terraform1.4.6", "plan", "-input=false", "-refresh", "-out", "/atlantis-data/repos/leandromoreirati/my-storage/1/staging/terraform/staging-staging.tfplan", "-var-file", "environments/staging.tfvars.json"}
2024-07-29T00:14:25.785Z [INFO]  CLI command args: []string{"plan", "-input=false", "-refresh", "-out", "/atlantis-data/repos/leandromoreirati/my-storage/1/staging/terraform/staging-staging.tfplan", "-var-file", "environments/staging.tfvars.json"}
2024-07-29T00:14:36.308Z [INFO]  backend/local: starting Plan operation
2024-07-29T00:14:36.504Z [INFO]  provider: configuring client automatic mTLS
2024-07-29T00:14:36.983Z [INFO]  provider.terraform-provider-azurerm_v3.113.0_x5: configuring server automatic mTLS: timestamp=2024-07-29T00:14:36.983Z
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.782Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:43.805Z [INFO]  provider: configuring client automatic mTLS
2024-07-29T00:14:44.085Z [INFO]  provider.terraform-provider-azurerm_v3.113.0_x5: configuring server automatic mTLS: timestamp=2024-07-29T00:14:44.085Z
2024-07-29T00:14:51.488Z [INFO]  backend/local: plan calling Plan
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.490Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:14:51.594Z [INFO]  provider: configuring client automatic mTLS
2024-07-29T00:14:51.881Z [INFO]  provider.terraform-provider-azurerm_v3.113.0_x5: configuring server automatic mTLS: timestamp=2024-07-29T00:14:51.881Z
2024-07-29T00:14:58.485Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/hashicorp/azurerm\"]" changed the config value, but that value is unused
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "var.storage_accounts"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "var.tags"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.488Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.783Z [WARN]  Provider "registry.terraform.io/hashicorp/azurerm" produced an invalid plan for module.storage.azurerm_storage_account.default["demo"], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .dns_endpoint_type: planned value cty.StringVal("Standard") for a non-computed attribute
      - .tags: planned value cty.NullVal(cty.Map(cty.String)) does not match config value cty.MapValEmpty(cty.String)
      - .sftp_enabled: planned value cty.False for a non-computed attribute
      - .local_user_enabled: planned value cty.True for a non-computed attribute
      - .routing: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .blob_properties: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .queue_properties: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .share_properties: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .network_rules: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-07-29T00:15:07.883Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.883Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.883Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.883Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.883Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.883Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.884Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.884Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.884Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.884Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.884Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.884Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.884Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.884Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.884Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.884Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.884Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.884Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.884Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.885Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-07-29T00:15:07.889Z [INFO]  backend/local: plan operation completed
2024-07-29T00:15:07.889Z [INFO]  backend/local: writing plan output to: /atlantis-data/repos/leandromoreirati/my-storage/1/staging/terraform/staging-staging.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.storage.azurerm_storage_account.default["demo"] will be created
+ resource "azurerm_storage_account" "default" {
+       access_tier                        = "Hot"
+       account_kind                       = "StorageV2"
+       account_replication_type           = "LRS"
+       account_tier                       = "Standard"
+       allow_nested_items_to_be_public    = false
+       cross_tenant_replication_enabled   = false
+       default_to_oauth_authentication    = false
+       dns_endpoint_type                  = "Standard"
+       enable_https_traffic_only          = true
+       id                                 = (known after apply)
+       infrastructure_encryption_enabled  = false
+       is_hns_enabled                     = false
+       large_file_share_enabled           = false
+       local_user_enabled                 = true
+       location                           = "eastus"
+       min_tls_version                    = "TLS1_2"
+       name                               = "mystorage"
+       nfsv3_enabled                      = false
+       primary_access_key                 = (sensitive value)
+       primary_blob_connection_string     = (sensitive value)
+       primary_blob_endpoint              = (known after apply)
+       primary_blob_host                  = (known after apply)
+       primary_blob_internet_endpoint     = (known after apply)
+       primary_blob_internet_host         = (known after apply)
+       primary_blob_microsoft_endpoint    = (known after apply)
+       primary_blob_microsoft_host        = (known after apply)
+       primary_connection_string          = (sensitive value)
+       primary_dfs_endpoint               = (known after apply)
+       primary_dfs_host                   = (known after apply)
+       primary_dfs_internet_endpoint      = (known after apply)
+       primary_dfs_internet_host          = (known after apply)
+       primary_dfs_microsoft_endpoint     = (known after apply)
+       primary_dfs_microsoft_host         = (known after apply)
+       primary_file_endpoint              = (known after apply)
+       primary_file_host                  = (known after apply)
+       primary_file_internet_endpoint     = (known after apply)
+       primary_file_internet_host         = (known after apply)
+       primary_file_microsoft_endpoint    = (known after apply)
+       primary_file_microsoft_host        = (known after apply)
+       primary_location                   = (known after apply)
+       primary_queue_endpoint             = (known after apply)
+       primary_queue_host                 = (known after apply)
+       primary_queue_microsoft_endpoint   = (known after apply)
+       primary_queue_microsoft_host       = (known after apply)
+       primary_table_endpoint             = (known after apply)
+       primary_table_host                 = (known after apply)
+       primary_table_microsoft_endpoint   = (known after apply)
+       primary_table_microsoft_host       = (known after apply)
+       primary_web_endpoint               = (known after apply)
+       primary_web_host                   = (known after apply)
+       primary_web_internet_endpoint      = (known after apply)
+       primary_web_internet_host          = (known after apply)
+       primary_web_microsoft_endpoint     = (known after apply)
+       primary_web_microsoft_host         = (known after apply)
+       public_network_access_enabled      = false
+       queue_encryption_key_type          = "Service"
+       resource_group_name                = "my-rg"
+       secondary_access_key               = (sensitive value)
+       secondary_blob_connection_string   = (sensitive value)
+       secondary_blob_endpoint            = (known after apply)
+       secondary_blob_host                = (known after apply)
+       secondary_blob_internet_endpoint   = (known after apply)
+       secondary_blob_internet_host       = (known after apply)
+       secondary_blob_microsoft_endpoint  = (known after apply)
+       secondary_blob_microsoft_host      = (known after apply)
+       secondary_connection_string        = (sensitive value)
+       secondary_dfs_endpoint             = (known after apply)
+       secondary_dfs_host                 = (known after apply)
+       secondary_dfs_internet_endpoint    = (known after apply)
+       secondary_dfs_internet_host        = (known after apply)
+       secondary_dfs_microsoft_endpoint   = (known after apply)
+       secondary_dfs_microsoft_host       = (known after apply)
+       secondary_file_endpoint            = (known after apply)
+       secondary_file_host                = (known after apply)
+       secondary_file_internet_endpoint   = (known after apply)
+       secondary_file_internet_host       = (known after apply)
+       secondary_file_microsoft_endpoint  = (known after apply)
+       secondary_file_microsoft_host      = (known after apply)
+       secondary_location                 = (known after apply)
+       secondary_queue_endpoint           = (known after apply)
+       secondary_queue_host               = (known after apply)
+       secondary_queue_microsoft_endpoint = (known after apply)
+       secondary_queue_microsoft_host     = (known after apply)
+       secondary_table_endpoint           = (known after apply)
+       secondary_table_host               = (known after apply)
+       secondary_table_microsoft_endpoint = (known after apply)
+       secondary_table_microsoft_host     = (known after apply)
+       secondary_web_endpoint             = (known after apply)
+       secondary_web_host                 = (known after apply)
+       secondary_web_internet_endpoint    = (known after apply)
+       secondary_web_internet_host        = (known after apply)
+       secondary_web_microsoft_endpoint   = (known after apply)
+       secondary_web_microsoft_host       = (known after apply)
+       sftp_enabled                       = false
+       shared_access_key_enabled          = true
+       table_encryption_key_type          = "Service"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "container_access_type"
│ but a value was found in file "environments/staging.tfvars.json". If you
│ meant to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Error: Invalid API Key, please check your INFRACOST_API_KEY environment variable or /home/atlantis/.config/infracost/credentials.yml credentials file.
If you recently regenerated your API key, you can retrieve it from https://dashboard.infracost.io.
See https://infracost.io/support if you continue having issues.

Update: A new version of Infracost is available: v0.10.37 → v0.10.38
  $ curl -fsSL https://raw.githubusercontent.com/infracost/infracost/master/scripts/install.sh | sh
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://135.237.3.8/lock?id=leandromoreirati%252Fmy-storage%252Fterraform%252Fstaging)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p staging
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```